Public Attributes | List of all members
API_3DCutShapeType Struct Reference
View Handling
Shape of the 3D cutting plane. More...
#include <APIdefs_Environment.h>
 Public Attributes
 short  | cutStatus
Reserved for internal use.
 short  | cutPen
Pen of the cutplane.
 API_AttributeIndex  | cutMater
Material of the cutplane.
 double  | pa
Horizontal coordinate of the begin of the section line.
 double  | pb
Vertical coordinate of the begin of the section line.
 double  | pc
Horizontal coordinate of the end of the section line.
 double  | pd
Vertical coordinate of the end of the section line.
Detailed Description
Shape of the 3D cutting plane.
Remarks
This structure is a member of API_3DCutPlanesInfo.